Repository: andrecini/TesteOmegaT
Catalog: testeomegat-level1.tmx
Source language: pt_br
Languages: es

source: (apenas um cenário cobre 100%)
es: (only one scenario covers 100%)

source: (implementação 2)
es: (implementation 2)

source: 2.1 Seleção – if, case
es: 2.1Selection – if, case

source: 2.3 Operadores – “&&”, “||”, “?”
es: Operators – “&&”, “||”, “?”

source: 2.4 Exceções – catch, throw e throws
es: Exceptions – catch, throw e throws

source: if (casquinha) {
es: if (coverings) {

source: if (coberturas > 1){
es: if (coverings > 1){

source: int preco = 0;
es: int price = 0;

source: preco = 15;
es: } else {

source: preco = 20;
es: price = 20;

source: preco = preco + 1;
es: price = price +1;

source: preco = preco + 2;
es: price = price +2;

source: return preco;
es: return prices;

source: A Figura 13 mostra a complexidade ciclomática sobreposta com os quatro caminhos possíveis (A: vermelho, B: verde, C: amarelo e D: azul).
es: Figure 13 shows the cyclomatic complexity overlaid with the four possible paths (A: red, B: green, C: yellow and D: blue).

source: A Figura 4 mostra um exemplo em Java desta contagem feita pelo SonarQube.
es: Figure 4 shows a Java example of this count made by SonarQube.

source: A Figura 8 mostra uma implementação ainda mais simples onde o caminho principal fica mais explícito.
es: Figure 8 shows an even simplerimplementation where the main path becomes more explicit.

source: A cobertura pode ser simples (apenas uma) custando R$1 ou especial (duas coberturas ou mais) custando R$2.
es: The coverage can be simple (just one) costing R $ 1 or special (two coverages or more) costing R$ 2.

source: A implementação do requisito de cálculo de preço do sorvete com If/Else gerou a necessidade de dois casos de teste.
es: The implementation of the ice cream price requirement with If Else generated the need for two test cases.

source: A partir destas três informações o algoritmo calcula o preço do sorvete.
es: From these three pieces of information, the algorithm calculates the price of the ice cream.

source: Adicione mais um ponto para cada elemento abaixo:
es: Add one more point for each element below:

source: Agora a cobertura de testes requer um pouco mais de cenários.
es: Testing coverage now requires a little more scenarios.

source: Ao aplicar o cálculo por palavra-chave sobre o algoritmo chegamos a um valor de complexidade ciclomática igual a 4 (um ponto pelo método e mais um para cada um dos três “Ifs”).
es: When applying the calculation by keyword on the algorithm we arrive at a value of cyclomatic complexity equal to4 (one point for the method and one more for each of the three “Ifs”).

source: Apesar de oito combinações, já sabemos que o total de caminhos possível (NPATH) é diferente da complexidade ciclomática.
es: Despite eight combinations, we already know that the total number of possible paths (NPATH) is different from the cyclomatic complexity.

source: As oito combinações correspondem aos oito caminhos possíveis do algoritmo de cálculo de preço.
es: The eight combinations correspond to the eight possible paths of the price calculation algorithm.

source: Assim, a complexidade ciclomática cresce na medida em que instruções de decisão são inseridas no código.
es: Thus, the cyclomatic complexity increases as decision instructions are inserted into the code.

source: Assim, como visto nos exemplos, eventualmente pode ser necessário um pouco mais ou um pouco menos, dependendo da implementação, mas a quantidade de caminhos linearmente independentes é um bom palpite para a quantidade e para os pontos de passagem dos cenários de teste.
es: So, as seen in the examples, it may be necessary a little more or a little less, depending on the implementation, but the number of linearly independent paths is a good guess for the quantity and the points of passing of the test scenarios.

source: Através desta fórmula é possível que sejam calculados valores de complexidade ciclomática sem a necessidade de desenhar o grafo de fluxo de controle, apenas identificando quais palavras reservadas das linguagens correspondem a decisões ou retornos antes do fim do programa, método, rotina ou função.
es: Through this formula it is possible to calculate values ​​of cyclomatic complexity without the need to draw the control flow graph, just identifying which reserved words of the languages ​​correspond to decisions or returns before the end of the program, method, routine or function.

source: Caminho Linearmente Independente
es: Linearly Independent Path

source: Caminho Linearmente Independente é qualquer caminho do programa que introduz pelo menos um novo conjunto de comandos de processamento ou uma nova condição.
es: Linearly Independent Path is any program path that introduces at least one new set of processing commands or a new condition.

source: Com base nessa forma de cálculo, qualquer nova decisão introduzida no algoritmo vai fazer a complexidade ciclomática aumentar em 1 ponto, pois adiciona um nó com duas arestas.
es: Based on this form of calculation, any new decision introduced in the algorithm will increase the cyclomatic complexity by 1 point, as it adds a node with two edges.

source: Com o desenho feito desta forma, basta subtrair o número de arestas pelo número de nós do grafo resultante e somar um.
es: With the drawing done in this way, just subtract the number of edges by the number of nodes in the resulting graph and add one.

source: Com um único cenário de teste (o sorvete mais caro) todas as linhas são percorridas.
es: With a single test scenario (the most expensive ice cream) all lines are covered.

source: Como foi visto nas três implementações diferentes do problema da sorveteria, não é factível elaborar um caso de testes para cada possibilidade de execução de um algoritmo, pois mesmo implementações simples gerarão testes de unidade muito mais complexos que elas mesmas e acabarão sendo abandonados com o passar do tempo.
es: As seen in the three different implementations of the ice cream parlor problem, it is not feasible to develop a test case for each possibility of executing an algorithm, because even simple implementations will generate unit tests that are much more complex than they are. and will end up being abandoned over time.

source: Como você já deve ter percebido, não será possível fazer um desenho do grafo representado pelo algoritmo toda vez que precisarmos calcular complexidade ciclomática de algum código.
es: As you may have noticed, it will not be possible to draw a graph of the graph represented by the algorithm every time we need to calculate complexity cyclomatic of some code.

source: Complexidade Ciclomática
es: Cyclomatic Complexity

source: Complexidade ciclomática é uma medida de software, elaborada em 1976 por Thomas McCabe [1] para medir a complexidade de um programa (classe, método, rotina etc).
es: Cyclomatic complexity is a software measure, developed in 1976 by Thomas McCabe [1] to measure the complexity of a program (class, method, routine, etc.).

source: Conclusão
es: Conclusion

source: Conforme apresentado, a complexidade ciclomática, cujo objetivo inicial era medir a complexidade de programas, apresenta forte relação com a testabilidade.
es: As shown, the cyclomatic complexity, whose initial objective was to measure the complexity of programs, has a strong relationship with testability.

source: Cálculo pelo Grafo de Fluxo de Controle
es: Control Flow Graph Calculation

source: Cálculo por Palavra Reservada
es: Calculation by Reserved Word

source: Da mesma forma, cresce a necessidade de casos de teste para cobrir todo este código.
es: Likewise, there is a growing need for test cases to cover all of this code.

source: Dessa forma apenas dois cenários acabaram passando por todas as suas linhas.
es: Thus, only two scenarios ended up passing through all its lines.

source: Dessa forma, todas os nós foram percorridos ao menos uma vez e verificamos graficamente porque a complexidade ciclomática é 4.
es: Thus, all nodes have been traversed at least once and we verify graphically because the cyclomatic complexity is 4.

source: Dessa forma, a fórmula de cálculo da complexidade ciclomática pode ser simplificada para “π – s + 2” onde “π” é a quantidade de pontos de decisão e “s” é a quantidade de pontos de saída.
es: In this way, the formula for calculating cyclomatic complexity can be simplified to “π - s + 2” where “π” is the number of decision points and “s” is the number of exit points.

source: Do ponto de vista prático e da qualidade de software, o valor de complexidade ciclomática pode ser usado como medida de qualidade de um código, assim como outras medidas, indicando sua complexidade, mas especialmente sua dificuldade de implementar testes de unidade.
es: From a practical and software quality point of view, the cyclomatic complexity value can be used as a measure of the quality of a code, as well as other measures, indicating its complexity, but especially its difficulty of implement unit tests.

source: Em termos mais atuais, pode-se dizer que ela indica a dificuldade de se construir testes de unidade em um determinado código uma vez que ela mede a quantidade de caminhos linearmente independentes neste código.
es: In more current terms, it can be said that it indicates the difficulty of building unit tests on a given code since it measures the number of linearly independent paths in this code.

source: Em termos mais simples, ao escrever um teste de unidade para passar por todos os caminhos linearmente independentes você provavelmente terá coberto todas as linhas deste código, estabelecendo uma cobertura de 100%.
es: In simpler terms, when writing a unit test to go through all linearly independent paths, you will probably have covered all the lines of this code, establishing 100% coverage.

source: Em uma terceira implementação onde o requisito mudou um pouco os “IFs” estarão aninhados, tornando o código um pouco mais difícil de ler.
es: In a third implementation where the requirement has changed slightly the “IFs ” will be nested, making the code a little more difficult to read.

source: Esta nova implementação gerou uma situação onde a quantidade de cenários de teste para cobertura de todas as linhas baixou para um.
es: This new implementation generated a situation where the number of test scenarios for covering all lines dropped to one.

source: Este cálculo simplificado pode ser descrito da seguinte forma:
es: This simplified calculation can be described as follows:

source: Este valor pode ser visualizado graficamente na Figura 6.
es: This value can be viewed graphically in Figure 6.

source: Exemplo da Sorveteria – Requisito Novo e Implementação 3
es: Ice Cream Shop Example - New Requirement and Implementation 3

source: Exemplo da Sorveteria – Requisito e Implementação 1
es: Ice Cream Shop Example - Requirement and Implementation 1

source: Figura 11: Cenário de teste para testar a implementação 2
es: Figure 11: Test scenario for testing implementation 2

source: Figura 12: Implementação 3 com IFs aninhados
es: Figure 12: Implementation 3 with nested IFs

source: Figura 13: Caminhos e complexidade ciclomática da implementação 3
es: Figure 13: Paths and complexity cyclomatic of the implementation 3

source: Figura 14: Dois cenários de teste cobrindo 77,6% das linhas da implementação 3
es: Figure 14: Two test scenarios covering 77.6% of the implementation lines 3

source: Figura 15: Quatro cenários de teste cobrindo 100% das linhas da implementação 3
es: Figure 15: Four test scenarios covering 100% of the implementation lines 3

source: Figura 1: Algoritmo de exemplo
es: Example algorithm

source: Figura 2: Três caminhos independentes e um quarto repetindo instruções
es: Figure 2: Three independent paths and a fourth repeating instructions

source: Figura 3: Grafo com nós e arestas
es: Graph with knots and edges

source: Figura 4: Exemplo de contagem em código Java feito pelo Sonar
es: Figure 4: Example of Java code counting done by Sonar

source: Figura 5: Oito combinações possíveis do sorvete e seu preço final
es: Figure 5: Eight possible combinations of ice cream and its final price

source: Figura 6: Quatro caminhos linearmente independentes do algoritmo da sorveteria
es: Figure 6: Four paths linearly independent of the ice cream shop algorithm

source: Figura 7: Dois cenários de teste cobrindo 100% das linhas de código
es: Figure 7: Two test scenarios covering 100% of the lines of code

source: Figura 8: Implementação alternativa com caminho principal e sem “elses”
es: Figure 8: Alternative implementation with main path and without “elses”

source: Figura 9: Oito caminhos possíveis para implementação 2
es: Figure 9: Eight possible paths for implementation 2

source: Fluxo – return que não seja o último
es: Flow - return that is not the last

source: Há dois tipos de sorvete: Comum, cujo preço é R$15 e Premium cujo preço é R$20
es: There are two types of ice cream: Common, whose price is R $ 15 and Premium whose price is R$ 20

source: Imagine uma sorveteria que define o preço de seus sorvetes da seguinte forma:
es: Imagine an ice cream shop that sets the price of your ice cream as follows:

source: Isso não significa que esta implementação só precisa de um cenário em seu teste de unidade, apenas que com apenas um (o certo) todas as linhas serão cobertas.
es: This does not mean that this implementation nly needs one scenario in its unit test, only that with just one (the right one) all lines will be covered.

source: Isso não é a mesma coisa que cobrir todas as possibilidades de execução (NPATH) e sim passar por todas as linhas ao menos uma vez. O exemplo da figura 1 mostra, graficamente, um algoritmo onde as letras representam uma instrução simples e os números representam um “IF” (decisão).
es: This is not the same thing as covering all the possibilities of execution (NPATH), but going through all the lines at least once. The example in figure 1 shows, graphically, an algorithm where the letters represent a simple instruction and the numbers represent an “IF” (decision).

source: Isso se deve a particularidade de como o requisito foi implementado.
es: This is due to the particularity of how the requirement was implemented.

source: Mais a frente veremos que a complexidade ciclomática é um indicador bem melhor para sugerir o número de casos de teste necessários em um teste de unidade.
es: Later on we will seethat the cyclomatic complexity is a much better indicator for suggesting the number of test cases needed in a unit test.

source: Mais a frente o algoritmo será alterado sem alterar seu resultado e veremos que a quantidade de casos de teste necessário vai mudar.
es: Later on, the algorithm will be changed without changing its result and we will see that the number of test cases needed will change.

source: Medidas mais atuais como a complexidade cognitiva podem indicar melhor a dificuldade de leitura e entendimento de um código, mas a complexidade ciclomática ainda mantém forte relação com a testabilidade.
es: More current measures such as cognitive complexity may better indicate the difficulty of reading and understanding a code, but cyclomatic complexity still has a strong relationship with testability.

source: Na Figura 12 pode ser vista esta nova implementação e seu grafo correspondente.
es: In Figure 12, this new implementation and its corresponding graph can be seen.

source: Na Figura 14 pode-se ver que os mesmos dois cenários (mais barato 17 e mais caro 24) que cobriam 100% das linhas na implementação 1 agora cobrem somente 77,6% das linhas.
es: In Figure 14, it can be seen that the same two scenarios (cheapest 17 and most expensive 24) that covered 100% of the lines in the 1 implementation now cover only 77.6% of the lines.

source: Na Figura 2, o mesmo algoritmo é desmembrado em seus caminhos possíveis (NPATH) que são 4, porém somente os três primeiros são linearmente independentes.
es: In Figure 2, the same algorithm is broken down into its possible paths (NPATH) which are 4, but only the first three are linearly independent.

source: Na Figura 9 é possível ver que nesta implementação continuam existindo as oito possibilidades de sorvete e na Figura 10 que a complexidade ciclomática continua 4 (um do método mais um para cada “IF” – os “elses” não interferem).
es: In Figure 9 it is possible to see that in this implementation the eight ice cream possibilities still exist and in Figure 10 that the cyclomatic complexity continues4 (one of the method plus one for each “IF” - the “elses” do not interfere).

source: Neste cenário somente os sorvetes premium têm casquinha e somente as casquinhas têm mais de uma cobertura.
es: In this scenario, only the premium ice creams have a cone and only the cones have more than one icing.

source: No caminho C foi destacada em amarelo a instrução onde a execução passa pela instrução do preço da casquinha e o caminho D mostra a passagem (em azul) pela instrução do preço mais caro da cobertura dupla.
es: In path C, the instruction where the execution goes through the instruction of the cone price was highlighted in yellow and path D shows the passage (in blue) for the instruction of the most expensive price of the double roof. <segment 0104>

source: No entanto, a complexidade ciclomática irá para 4, pois será adicionada mais um nó (bolinha) e duas arestas (setas).
es: However, the cyclomatic complexity will go to 4, as another node (ball) and two edges (arrows) will be added.

source: No entanto, não é difícil perceber o que acontecerá com este teste se mais “IFs” forem adicionados.
es: However, it is not difficult to see what will happen with this test if more “IFs” are added.

source: No exemplo acima, apesar de haver 4 caminhos possíveis (NPATH), podemos dizer que a complexidade ciclomática do algoritmo representado graficamente é 3, ou seja, é igual ao número de caminhos linearmente independentes.
es: In the example above, although there are 4 possible paths (NPATH), we can say that the cyclomatic complexity of the graphically represented algorithm is 3, that is, it is equal to the number of linearly independent paths.

source: No exemplo em questão, o limite de complexidade ciclomática foi baixado para 3 para que o Sonar criasse uma Issue e a visualização fosse possível desta forma, mas ele vem calibrado com um limite de 10 para esta medida – veja em [Controle de Complexidade].
es: In the example in question, the complexity limit cyclomatic was lowered to 3 so that Sonar created a Issue and visualization was possible this way, but it is calibrated with a limit of 10 for this measure.

source: O SonarQube é uma das ferramentas mais usadas para aferição deste tipo de medição.
es: The SonarQube is one of the most used tools for measuring this type of measurement.

source: O algoritmo em questão tem uma espécia de caminho principal e um caminho alternativo.
es: The algorithm in question has aspecies of main path and an alternative path.

source: O caminho A destaca em vermelho todas as instruções por onde o algoritmo passou.
es: Path A highlights in red all instructions where the algorithm passed.

source: O caminho B destaca em verde a instrução de preço premium por onde o caminho A não havia passado e de cinza onde passou de novo.
es: Path B highlights in green the price instruction premium where path A had not passed and gray where it passed again.

source: O comportamento e os caminhos possíveis (agora 4) são diferentes das duas anteriores, porém a complexidade ciclomática ainda é 4.
es: The possible behavior and paths (now 4) are different from the previous two, however the cyclomatic complexity is still 4.

source: O copinho adiciona R$1 ao preço enquanto a casquinha adiciona R$2.
es: The cup adds R $ 1 to the price while the cone adds R $ 2.

source: O crescimento do número de casos de teste será exponencial e em breve será impossível manter uma cobertura alta para este algoritmo.
es: The growth in the number of test cases will be exponential and soon it will be impossible to maintain high coverage for this algorithm.

source: O cálculo do exemplo dá um valor total de 5, pois soma-se um ao método (linha 7), mais um pelo primeiro “IF” (linha 8), mais um pelo “return” que não é o último, mais um pelo “while” e pelo “&&” (linha 14).
es: The calculation of the example gives a total value of 5 , since one is added to the method (line 7), plus one by the first “IF” (line 8), plus one by “return ”which is not the last, plus one for“ while ”and“ && ”(line 14).

source: O cálculo do preço do sorvete pode ser representado pelo seguinte código escrito em java (implementação 1):
es: The calculation of the ice cream price can be represented by the following code written in java (implementation 1):

source: O método espera três parâmetros baseados na definição do preço do sorvete onde o cliente deve informar três coisas: tipo do sorvete (se é premium ou não), recipiente (se quer na casquinha ou não) e cobertura (uma ou mais).
es: The method expects three parameters based on the price definition of the ice cream where the customer must inform three things: type of ice cream (whether it is premium or not), container (whether in the cone or not) and cover (one or more).

source: O sorvete pode ser vendido em copinho ou casquinha.
es: Ice cream can be sold in a cup or cone.

source: O valor inicia em “1” para o método, função ou rotina (com ou sem retorno)
es: The value starts at “1” for the method, function or routine (with or without return)

source: Obs: else, default, finally, “:” e o último return não incrementam a contagem
es: Note: else, default, finally, “:” and the last return do not increase the count

source: Observe agora, na Figura 7, que apenas dois casos de teste são suficientes para cobrir 100% das linhas de código.
es: Notice now, in Figure 7, that only two test cases are sufficient to cover 100% of the lines of code.

source: Outra mudança nesta implementação é a necessidade de casos de teste para que todas as linhas sejam percorridas.
es: Another change in this implementation is the need for test cases so that all lines are covered.

source: Para “programas simples” (rotinas, métodos, funções etc) com apenas uma saída, o cálculo de caminhos linearmente independentes é feito considerando-se que o algoritmo é fortemente conectado e uma linha de retorno deve ser feita até o início do algoritmo como no exemplo da Figura 3.
es: For “simple programs” (routines, methods, functions, etc.) with only one output, the calculation of linearly independent paths is done considering that the algorithm is strongly connected and a return line must be made until the beginning of the algorithm as in example in Figure 3.

source: Pode-se dizer que a complexidade ciclomática é o limite superior do número de cenários de teste necessários para cobrir 100% das linhas de código.
es: It can be said that the cyclomatic complexity is the upper limit on the number of test scenarios needed to cover 100% of the lines of code .

source: Por outro lado, o valor de complexidade ciclomática parece ser uma meta bem mais razoável para elaboração de cenários de teste para um determinado código fonte.
es: On the other hand, the complexity value cyclomatic seems to be a much more reasonable goal for the elaboration of test scenarios for a given source code.

source: Quando definido em termos de grafo de fluxo, um caminho independente deve incluir pelo menos uma aresta que não tenha sido atravessada antes de o caminho ser definido (Pressman)[2].
es: When defined in terms of flow graph, an independent path must include at least one edge that was not traversed before the path was defined (Pressman) [2].
